# Using Views in MySQL

In [4]:
import mysql.connector as mysql 
# import sqlalchemy # not doing any writes so no need for sqlalchemy
import os 
from dotenv import load_dotenv

load_dotenv('/workspaces/IBM-DS-Course/.env')
user=os.getenv('USER')
password=os.getenv('PASSWORD')
host='localhost'
port =3306
db='HR'

In [5]:
# !docker stop mysql-container
# !docker start mysql-container
# !docker ps

mysql-container
mysql-container
CONTAINER ID   IMAGE     COMMAND                  CREATED      STATUS                  PORTS                                                  NAMES
50e33c579e3f   mysql     "docker-entrypoint.s…"   2 days ago   Up Less than a second   0.0.0.0:3306->3306/tcp, :::3306->3306/tcp, 33060/tcp   mysql-container

In [6]:
conn = mysql.connect(
    host=host,
    user=user,
    password=password,
    port=port
)
use = f'USE {db}'
cursor = conn.cursor()
cursor.execute(use)

## Task 1: Create a View

1. Let's create a view called EMPSALARY to display salary along with some basic sensitive data of employees from the HR database.

- To create the EMPSALARY view from the EMPLOYEES table, Copy the code below and paste it to the textarea of the SQL page. Click Go.
2. Using SELECT, query the EMPSALARY view to retrieve all the records. Use the following statement.

In [7]:
view1 = '''CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;'''
cursor.execute(view1) # 1
q_view1 = '''SELECT * FROM EMPSALARY;
'''
cursor.execute(q_view1) # 2

In [8]:
output1 = cursor.fetchall()
print(*[row for row in output1], sep='\n')

('E1001', 'John', 'Thomas', '1976-09-01', 'M', 100000)
('E1002', 'Alice', 'James', '1972-07-31', 'F', 80000)
('E1003', 'Steve', 'Wells', '1980-10-08', 'M', 50000)
('E1004', 'Santosh', 'Kumar', '1985-07-20', 'M', 60000)
('E1005', 'Ahmed', 'Hussain', '1981-04-01', 'M', 70000)
('E1006', 'Nancy', 'Allen', '1978-06-02', 'F', 90000)
('E1007', 'Mary', 'Thomas', '1975-05-05', 'F', 65000)
('E1008', 'Bharath', 'Gupta', '1985-06-05', 'M', 65000)
('E1009', 'Andrea', 'Jones', '1990-09-07', 'F', 70000)
('E1010', 'Ann', 'Jacob', '1982-03-30', 'F', 70000)

## Task 2: Update a View

1. update a View to combine two or more tables in meaningful ways.

- Assume that the EMPSALARY view we created in Task 1 doesn't contain enough salary information, such as max/min salary and the job title of the employees. 

- For this, we need to get information from other tables in the database. 

- You need all columns from EMPLOYEES table used above, except for SALARY. You also need the columns JOB_TITLE, MIN_SALARY, MAX_SALARY of the JOBS table.

In [12]:
view2 = '''CREATE OR REPLACE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE,
MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;'''

2. Using SELECT, query the updated EMPSALARY view to retrieve all the records. 

- Copy the code below and paste it to the textarea of the SQL page. Click Go.

In [13]:
cursor.execute(view2) # 1
q_view2 = '''SELECT * FROM EMPSALARY;
'''
cursor.execute(q_view2) # 2

In [14]:
output2 = cursor.fetchall()
print(*[row for row in output2], sep='\n')

('E1001', 'John', 'Thomas', '1976-09-01', 'M', 'Sr. Architect', 60000, 100000)
('E1002', 'Alice', 'James', '1972-07-31', 'F', 'Sr. Software Developer', 60000, 80000)
('E1003', 'Steve', 'Wells', '1980-10-08', 'M', 'Jr.Software Developer', 40000, 60000)
('E1004', 'Santosh', 'Kumar', '1985-07-20', 'M', 'Jr.Software Developer', 40000, 60000)
('E1005', 'Ahmed', 'Hussain', '1981-04-01', 'M', 'Jr. Architect', 50000, 70000)
('E1006', 'Nancy', 'Allen', '1978-06-02', 'F', 'Lead Architect', 70000, 100000)
('E1007', 'Mary', 'Thomas', '1975-05-05', 'F', 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', '1985-06-05', 'M', 'Jr. Designer', 60000, 70000)
('E1009', 'Andrea', 'Jones', '1990-09-07', 'F', 'Sr. Designer', 70000, 90000)
('E1010', 'Ann', 'Jacob', '1982-03-30', 'F', 'Sr. Designer', 70000, 90000)

In [15]:
## Task 3: Drop a View

1. drop the created View EMPSALARY.

In [26]:
drop1= '''DROP VIEW EMPSALARY;
'''
cursor.execute(drop1)

Using SELECT, you can verify whether the EMPSALARY view has been deleted or not. Copy the code below and paste it to the textarea of the SQL page. Click Go.

In [27]:
q_view2 = '''SELECT * FROM EMPSALARY;
'''
cursor.execute(q_view2)

ProgrammingError: 1146 (42S02): Table 'HR.EMPSALARY' doesn't exist

## Practice Problems

1. Create a view “EMP_DEPT” which has the following information:
    
    EMP_ID, FNAME, LNAME and DEP_ID from EMPLOYEES table

In [30]:
p_view1 = '''CREATE OR REPLACE VIEW EMP_DEPT AS
SELECT EMP_ID, F_NAME, L_NAME, DEP_ID FROM EMPLOYEES'''
cursor.execute(p_view1)

2. Modify “EMP_DEPT” such that it displays Department names instead of Department IDs:

    For this, we need to combine information from EMPLOYEES and DEPARTMENTS as follows.
    EMP_ID, FNAME, LNAME from EMPLOYEES table and DEP_NAME from DEPARTMENTS table, combined over the columns DEP_ID and DEPT_ID_DEP.

In [31]:
p_view2 = '''CREATE OR REPLACE VIEW EMP_DEPT AS
SELECT e.EMP_ID, e.F_NAME, e.L_NAME, d.DEP_NAME FROM EMPLOYEES e JOIN DEPARTMENTS d ON e.DEP_ID = d.DEPT_ID_DEP'''
cursor.execute(p_view2)

In [34]:
q2 = '''SELECT * FROM EMP_DEPT;
'''
cursor.execute(q2) # 2
ans2 = cursor.fetchall()
print(*[row for row in ans2], sep='\n')

('E1001', 'John', 'Thomas', 'Architect Group')
('E1002', 'Alice', 'James', 'Software Group')
('E1003', 'Steve', 'Wells', 'Software Group')
('E1004', 'Santosh', 'Kumar', 'Software Group')
('E1005', 'Ahmed', 'Hussain', 'Architect Group')
('E1006', 'Nancy', 'Allen', 'Architect Group')
('E1007', 'Mary', 'Thomas', 'Design Team')
('E1008', 'Bharath', 'Gupta', 'Design Team')
('E1009', 'Andrea', 'Jones', 'Design Team')
('E1010', 'Ann', 'Jacob', 'Software Group')

3. Drop the view “EPM_DEPT”.

In [35]:
drop2 = '''DROP VIEW EMP_DEPT'''
cursor.execute(drop2)
cursor.execute(q2)
ans3 = cursor.fetchall()
print(*[row for row in ans3], sep='\n')

ProgrammingError: 1146 (42S02): Table 'HR.EMP_DEPT' doesn't exist

In [36]:
conn.close()